Tekla Open API Reference for Tekla Structures 2025
AngleDimension.Distance Property
 Gets or sets the distance (from the origin to the second point's direction). The distance is measured in paper millimeters.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Distance { get; set; }
Public Property Distance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AngleDimension Class
Tekla.Structures.Drawing Namespace